{
    "courses" : [
                    {
                        "provider_id" : 1,
                        "name" : "Astronomy: Exploring Time and Space",
                        "author" : "University of Arizona",
                        "link" : "https://coursera.org/learn/astro",
                        "description" : "This course is designed for anyone who is interested in learning more about modern astronomy. We will help you get up to date on the most recent astronomical discoveries while also providing support at an introductory level for those who have no background in science.",
                        "complexity" : 1,
                        "course_categories" :[ 1 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "The Evolving Universe",
                        "author" : "Caltech",
                        "link" : "https://coursera.org/learn/evolvinguniverse",
                        "description" : "This is an introductory astronomy survey class that covers our understanding of the physical universe and its major constituents, including planetary systems, stars, galaxies, black holes, quasars, larger structures, and the universe as a whole.",
                        "complexity" : 3,
                        "course_categories" :[ 1 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Астрофизика: от звезд до границ Вселенной",
                        "author" : "Polytech",
                        "link" : "https://www.coursera.org/learn/astrofizika",
                        "description" : "Этот курс посвящен ключевым проблемам современной астрофизики: рождению, эволюции и финальной стадии жизни звезд.\nНекоторые из них, например, нейтронные звезды отличаются сверхвысокой плотностью вещества и сверхсильными магнитными полями — такие условия пока недостижимы для современных лабораторий. Как же ученые исследуют эти объекты?\nВ курсе вы познакомитесь с работой специалистов астрофизики высоких энергий и нейтринной астрономии и разберетесь, зачем люди изучают вспышки сверхновых, ускорение заряженных частиц на космических ударных волнах и высокоэнергитичные нейтрино.\nА главы, посвященные теоретической и наблюдательной космологии, объяснят, как эта наука отвечает на вопросы о рождении Вселенной, динамике ее расширения и о формах материи ее заполняющих.",
                        "complexity" : 1,
                        "course_categories" :[ 1 ],
                        "language" : "Russian"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Introduction to Psychology",
                        "author" : "Yale University",
                        "link" : "https://www.coursera.org/learn/introduction-psychology",
                        "description" : "What are people most afraid of? What do our dreams mean? Are we natural-born racists? What makes us happy? What are the causes and cures of mental illness? This course tries to answer these questions and many others, providing a comprehensive overview of the scientific study of thought and behavior. It explores topics such as perception, communication, learning, memory, decision-making, persuasion, emotions, and social behavior.  We will look at how these aspects of the mind develop in children, how they differ across people, how they are wired-up in the brain, and how they break down due to illness and injury.",
                        "complexity" : 1,
                        "course_categories" :[ 2 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Stanford Introduction to Food and Health",
                        "author" : "Stanford University",
                        "link" : "https://www.coursera.org/learn/food-and-health",
                        "description" : "In this course, learners will be given the information and practical skills they need to begin optimizing the way they eat. This course will shift the focus away from reductionist discussions about nutrients and move, instead, towards practical discussions about real food and the environment in which we consume it. By the end of this course, learners should have the tools they need to distinguish between foods that will support their health and those that threaten it. In addition, we will present a compelling rationale for a return to simple home cooking, an integral part of our efforts to live longer, healthier lives.",
                        "complexity" : 3,
                        "course_categories" :[ 2 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Machine Learning",
                        "author" : "Stanford University",
                        "link" : "https://www.coursera.org/learn/machine-learning",
                        "description" : "This course provides a broad introduction to machine learning, datamining, and statistical pattern recognition. Topics include: (i) Supervised learning (parametric/non-parametric algorithms, support vector machines, kernels, neural networks). (ii) Unsupervised learning (clustering, dimensionality reduction, recommender systems, deep learning). (iii) Best practices in machine learning (bias/variance theory; innovation process in machine learning and AI).",
                        "complexity" : 1,
                        "course_categories" :[ 3 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Python for Everybody",
                        "author" : "University of Michigan",
                        "link" : "https://www.coursera.org/specializations/python",
                        "description" : "This Specialization builds on the success of the Python for Everybody course and will introduce fundamental programming concepts including data structures, networked application program interfaces, and databases, using the Python programming language. In the Capstone Project, you’ll use the technologies learned throughout the Specialization to design and create your own applications for data retrieval, processing, and visualization.",
                        "complexity" : 1,
                        "course_categories" :[ 4 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Introductions to Data Science in Python",
                        "author" : "University of Michigan",
                        "link" : "https://www.coursera.org/learn/python-data-analysis",
                        "description" : "This course will introduce the learner to the basics of the python programming environment, including fundamental python programming techniques such as lambdas, reading and manipulating csv files, and the numpy library. The course will introduce data manipulation and cleaning techniques using the popular python pandas data science library and introduce the abstraction of the Series and DataFrame as the central data structures for data analysis, along with tutorials on how to use functions such as groupby, merge, and pivot tables effectively. By the end of this course, students will be able to take tabular data, clean it, manipulate it, and run basic inferential statistical analyses.",
                        "complexity" : 3,
                        "course_categories" :[ 3, 4 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Data Science Math Skills",
                        "author" : "Duke University",
                        "link" : "https://www.coursera.org/learn/datasciencemathskills",
                        "description" : "Data science courses contain math—no avoiding that! This course is designed to teach learners the basic math you will need in order to be successful in almost any data science math course and was created for learners who have basic math skills but may not have taken algebra or pre-calculus. Data Science Math Skills introduces the core math that data science is built upon, with no extra complexity, introducing unfamiliar ideas and math symbols one-at-a-time.\n\nLearners who complete this course will master the vocabulary, notation, concepts, and algebra rules that all data scientists must know before moving on to more advanced material.",
                        "complexity" : 1,
                        "course_categories" :[ 3, 5 ],
                        "language" : "English"
                    },
                    {
                        "provider_id" : 1,
                        "name" : "Машинное обучение и анализ данных",
                        "author" : "Moscow Institute of Physics and Teachnology",
                        "link" : "https://www.coursera.org/specializations/machine-learning-data-analysis",
                        "description" : "Мы покажем, как проходит полный цикл анализа, от сбора данных до выбора оптимального решения и оценки его качества. Вы научитесь пользоваться современными аналитическими инструментами и адаптировать их под особенности конкретных задач.\n\nВ рамках специализации вы освоите основные темы, необходимые в работе с большим массивом данных, в т.ч. современные методы классификации и регрессии, поиск структуры в данных, проведение экспериментов, построение выводов, базовая фундаментальная математика, основы программирования на Python.\n\nМы разберём, как построить рекомендательную систему, оценить эмоциональную окраску текста, спрогнозировать спрос на товар, оценить вероятность клика по рекламе и т.д.\n\nВ финале вам потребуется выполнить проект собственной системы, решающей любую актуальную для бизнеса задачу. Результатом будет наглядная работающая модель, которую вы сможете использовать в вашей повседневной работе или продемонстрировать на собеседовании.",
                        "complexity" : 3,
                        "course_categories" :[ 3, 4, 6 ],
                        "language" : "Russian"
                    }
                ],
    "categories" : [
        {
            "name": "Physics and Astronomy",
            "description": ""
        },
        {
            "name": "Health",
            "description": ""
        },
        {
            "name": "Data Science",
            "description": ""
        },
        {
            "name": "Python Programming",
            "description": ""
        },
        {
        	"name": "Probability Theory",
            "description": ""
        },
        {
        	"name": "Machine Learning",
            "description": ""
        }
    ]
}
